{"class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "data_format": "channels_last", "filters": 32, "activity_regularizer": null, "name": "conv2d_1", "kernel_size": [3, 3], "batch_input_shape": [null, 48, 48, 1], "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "dtype": "float32", "bias_constraint": null, "kernel_constraint": null, "dilation_rate": [1, 1], "bias_regularizer": null, "activation": "linear", "kernel_regularizer": null, "trainable": true}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_1", "trainable": true}}, {"class_name": "Conv2D", "config": {"use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "data_format": "channels_last", "filters": 32, "activity_regularizer": null, "name": "conv2d_2", "kernel_size": [3, 3], "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "bias_constraint": null, "activation": "linear", "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "trainable": true}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_2", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "data_format": "channels_last", "name": "max_pooling2d_1", "strides": [2, 2], "pool_size": [2, 2], "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "rate": 0.2, "trainable": true}}, {"class_name": "Conv2D", "config": {"use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "data_format": "channels_last", "filters": 64, "activity_regularizer": null, "name": "conv2d_3", "kernel_size": [3, 3], "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "bias_constraint": null, "activation": "linear", "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "trainable": true}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_3", "trainable": true}}, {"class_name": "Conv2D", "config": {"use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "data_format": "channels_last", "filters": 64, "activity_regularizer": null, "name": "conv2d_4", "kernel_size": [3, 3], "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "bias_constraint": null, "activation": "linear", "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "trainable": true}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_4", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "data_format": "channels_last", "name": "max_pooling2d_2", "strides": [2, 2], "pool_size": [2, 2], "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "rate": 0.2, "trainable": true}}, {"class_name": "Conv2D", "config": {"use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "data_format": "channels_last", "filters": 128, "activity_regularizer": null, "name": "conv2d_5", "kernel_size": [3, 3], "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "bias_constraint": null, "activation": "linear", "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "trainable": true}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_5", "trainable": true}}, {"class_name": "Conv2D", "config": {"use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "data_format": "channels_last", "filters": 128, "activity_regularizer": null, "name": "conv2d_6", "kernel_size": [3, 3], "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "bias_constraint": null, "activation": "linear", "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "trainable": true}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_6", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "data_format": "channels_last", "name": "max_pooling2d_3", "strides": [2, 2], "pool_size": [2, 2], "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "rate": 0.2, "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "name": "dense_1", "bias_constraint": null, "units": 512, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "activation": "linear", "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "trainable": true}}, {"class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "name": "batch_normalization_1", "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "gamma_constraint": null, "scale": true, "momentum": 0.99, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "trainable": true}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_7", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_4", "rate": 0.4, "trainable": true}}, {"class_name": "Dense", "config": {"use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "name": "dense_2", "bias_constraint": null, "units": 7, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "activation": "linear", "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "trainable": true}}, {"class_name": "Activation", "config": {"activation": "softmax", "name": "activation_8", "trainable": true}}], "keras_version": "2.0.3", "backend": "theano"}